lab2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet_pipe
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.01 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            symmetryPlane;
    }
    in_plane
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    out_plane
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet_pipe
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
}

// ************************************************************************* //
